## Terraform Lint/Plan Results
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
b2_bucket.terraform-state: Refreshing state... [id=c33185c9297d9b5484380d18]
cloudflare_record.root-a: Refreshing state... [id=9baadb4a0bef6e6e9e3fa50ab2bfe2c1]
cloudflare_record.mx-2: Refreshing state... [id=faafcadfad83b1236f4c929db14f3d18]
cloudflare_record.mx-1: Refreshing state... [id=7f7e451868fc1ffe53a7de678eb3bc93]
cloudflare_record.webbmail: Refreshing state... [id=103b1308497abba1cb8bcc4af7c5264f]
cloudflare_record.mail: Refreshing state... [id=f9cff3da6c43997e0e9eacaac8fbb589]
cloudflare_record.www-aaaa: Refreshing state... [id=42ee94b3fab962b8b21d1487ec734fbd]
cloudflare_record.webmail: Refreshing state... [id=457b0a51b6b0d9041801788e0dfd917f]
cloudflare_record.smtp: Refreshing state... [id=5f6a7752e884e3c824aae558732f2fd0]
cloudflare_zone_settings_override.tmeit-se-settings: Refreshing state... [id=6a806c0199e15cdf23bb3017a90bf149]
cloudflare_record.pop3: Refreshing state... [id=82cb3cd742c7d05bc2d03f25c59c82c3]
cloudflare_record.autoconfig: Refreshing state... [id=db6141ae25d9723d0cd72ff53df130e7]
cloudflare_record.mail2: Refreshing state... [id=60581cadb658f04d4d94bae9c8bfbbae]
cloudflare_record._autodiscover_tcp: Refreshing state... [id=152e2e33d0bd2d72dfa140bb525f829f]
cloudflare_record.www-a: Refreshing state... [id=5d3ab468a74e6757b07c36226406b661]
cloudflare_record.root-aaaa: Refreshing state... [id=5c120446a4bc1a2fb3eb480206844313]
cloudflare_record.imap: Refreshing state... [id=ac6aeafd9af224e07c88efdc9b5e4887]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_zone_settings_override.tmeit-se-settings is tainted, so must be replaced
-/+ resource "cloudflare_zone_settings_override" "tmeit-se-settings" {
      ~ id                       = "6a806c0199e15cdf23bb3017a90bf149" -> (known after apply)
      ~ initial_settings         = [
          - {
              - always_online               = "off"
              - always_use_https            = "off"
              - automatic_https_rewrites    = "on"
              - binary_ast                  = "off"
              - brotli                      = "on"
              - browser_cache_ttl           = 14400
              - browser_check               = "on"
              - cache_level                 = "aggressive"
              - challenge_ttl               = 1800
              - ciphers                     = []
              - cname_flattening            = "flatten_at_root"
              - development_mode            = "off"
              - early_hints                 = "off"
              - email_obfuscation           = "on"
              - filter_logs_to_cloudflare   = "off"
              - h2_prioritization           = "off"
              - hotlink_protection          = "off"
              - http2                       = "on"
              - http3                       = "on"
              - image_resizing              = "off"
              - ip_geolocation              = "on"
              - ipv6                        = "on"
              - log_to_cloudflare           = "on"
              - max_upload                  = 100
              - min_tls_version             = "1.0"
              - minify                      = [
                  - {
                      - css  = "off"
                      - html = "off"
                      - js   = "off"
                    },
                ]
              - mirage                      = "off"
              - mobile_redirect             = [
                  - {
                      - mobile_subdomain = ""
                      - status           = "off"
                      - strip_uri        = false
                    },
                ]
              - opportunistic_encryption    = "on"
              - opportunistic_onion         = "on"
              - orange_to_orange            = "off"
              - origin_error_page_pass_thru = "off"
              - origin_max_http_version     = ""
              - polish                      = "off"
              - prefetch_preload            = "off"
              - privacy_pass                = "on"
              - proxy_read_timeout          = "100"
              - pseudo_ipv4                 = "off"
              - response_buffering          = "off"
              - rocket_loader               = "off"
              - security_header             = [
                  - {
                      - enabled            = false
                      - include_subdomains = false
                      - max_age            = 0
                      - nosniff            = false
                      - preload            = false
                    },
                ]
              - security_level              = "medium"
              - server_side_exclude         = "on"
              - sort_query_string_for_cache = "off"
              - ssl                         = "full"
              - tls_1_2_only                = "off"
              - tls_1_3                     = "on"
              - tls_client_auth             = "off"
              - true_client_ip_header       = "off"
              - universal_ssl               = "on"
              - visitor_ip                  = "on"
              - waf                         = "off"
              - webp                        = "off"
              - websockets                  = "on"
              - zero_rtt                    = "off"
            },
        ] -> (known after apply)
      ~ initial_settings_read_at = "2022-10-02T06:20:41.580388934Z" -> (known after apply)
      ~ readonly_settings        = [
          - "advanced_ddos",
          - "cname_flattening",
          - "http2",
          - "long_lived_grpc",
          - "mirage",
          - "origin_error_page_pass_thru",
          - "polish",
          - "prefetch_preload",
          - "proxy_read_timeout",
          - "response_buffering",
          - "sort_query_string_for_cache",
          - "true_client_ip_header",
          - "webp",
          - "image_resizing",
        ] -> (known after apply)
      ~ zone_status              = "pending" -> (known after apply)
      ~ zone_type                = "full" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ settings {
          ~ automatic_https_rewrites    = "on" -> (known after apply)
          ~ binary_ast                  = "off" -> (known after apply)
          ~ ciphers                     = [] -> (known after apply)
          ~ cname_flattening            = "flatten_at_root" -> (known after apply)
          ~ filter_logs_to_cloudflare   = "off" -> (known after apply)
          ~ h2_prioritization           = "off" -> (known after apply)
          ~ http2                       = "on" -> (known after apply)
          ~ image_resizing              = "off" -> (known after apply)
          ~ log_to_cloudflare           = "on" -> (known after apply)
          ~ max_upload                  = 100 -> (known after apply)
          ~ mirage                      = "off" -> (known after apply)
          ~ opportunistic_encryption    = "on" -> (known after apply)
          ~ orange_to_orange            = "off" -> (known after apply)
          ~ origin_error_page_pass_thru = "off" -> (known after apply)
          + origin_max_http_version     = (known after apply)
          ~ polish                      = "off" -> (known after apply)
          ~ prefetch_preload            = "off" -> (known after apply)
          ~ proxy_read_timeout          = "100" -> (known after apply)
          ~ response_buffering          = "off" -> (known after apply)
          ~ sort_query_string_for_cache = "off" -> (known after apply)
          ~ tls_1_2_only                = "off" -> (known after apply)
          ~ tls_client_auth             = "off" -> (known after apply)
          ~ true_client_ip_header       = "off" -> (known after apply)
          ~ visitor_ip                  = "on" -> (known after apply)
          ~ waf                         = "off" -> (known after apply)
          + webp                        = (known after apply)
          ~ zero_rtt                    = "off" -> (known after apply)
            # (25 unchanged attributes hidden)

          ~ minify {
              ~ css  = "off" -> (known after apply)
              ~ html = "off" -> (known after apply)
              ~ js   = "off" -> (known after apply)
            }

          ~ mobile_redirect {
              + mobile_subdomain = (known after apply)
              ~ status           = "off" -> (known after apply)
              ~ strip_uri        = false -> (known after apply)
            }

          ~ security_header {
              ~ enabled            = false -> (known after apply)
              ~ include_subdomains = false -> (known after apply)
              ~ max_age            = 0 -> (known after apply)
              ~ nosniff            = false -> (known after apply)
              ~ preload            = false -> (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JustinLex, Action: `pull_request`*